/* <================================================================================================================> */
/* <============================================== ИМПОРТ НЕОБХОДИМЫХ МОДУЛЕЙ ======================================> */
/* <================================================================================================================> */

import mongoose from 'mongoose';
import express from 'express';
import { fileURLToPath } from 'url';
import { dirname } from 'path';

/* <================================================================================================================> */
/* <============================================= СОЗДАНИЕ НЕОБХОДИМЫХ ОБЪЕКТОВ ====================================> */
/* <================================================================================================================> */
const __filename = fileURLToPath(import.meta.url);      // jshint ignore:line
const __dirname = dirname(__filename);                  // jshint ignore:line

const app = express();                                  // Импортиурем главный объект фреймворка Express
app.set('view engine', 'pug');                          // Указываем, что работаем с PUG
app.set('views', `${__dirname}/views`);                 // Указываем путь к шаблонам PUG
app.use(express.static(`${__dirname}/public`));         // Указываем путь к статическим файлам
app.use(express.urlencoded({ extended: true }));        // Преобразовавние POST-запросов из urlencoded в obj

/* <================================================================================================================> */
/* <============================================== ИМПОРТ НЕОБХОДИМЫХ РОУТЕРОВ =====================================> */
/* <================================================================================================================> */

import homeRoutes from "./routes/home.js";
import addRoutes from "./routes/add.js";
import coursesRoutes from "./routes/courses.js";
import cartRoutes from "./routes/cart.js";

/* <================================================================================================================> */
/* <============================================== ВЫЗОВ НЕОБХОДИМЫХ РОУТЕРОВ ======================================> */
/* <================================================================================================================> */

// Обслуживание запросов, относящихся к:
app.use("/", homeRoutes);                               // Главной странице
app.use("/add", addRoutes);                             // Добавлению курсов
app.use("/courses", coursesRoutes);                     // Курсам
app.use("/cart", cartRoutes);                           // Корзиной

/* <================================================================================================================> */
/* <==================================================== ЗАПУСК СЕРВЕРА ============================================> */
/* <================================================================================================================> */

async function start() {
    await mongoose.connect("mongodb+srv://admin:efxa4QzGgW2TDqmk@mycluster.bvqgf.mongodb.net/myFirstDatabase?retryWrites=true&w=majority");
    app.listen(3000, () => {
        console.log("Сервер был успешно запущен!");
    });
}
start();