"use strict";

/* <================================================================================================================> */
/* <============================================== ИМПОРТ НЕОБХОДИМЫХ МОДУЛЕЙ ======================================> */
/* <================================================================================================================> */

import express from "express";
import Course from "../models/course.js";

/* <================================================================================================================> */
/* <====================================== ОБРАБОТКА РОУТОВ СТРАНИЦЫ ДОБАВЛЕНИЯ КУРСОВ =============================> */
/* <================================================================================================================> */

// Экспортируем роутер:
const addRoutes = express.Router();

// Обработка роутов страницы добавления курсов:
addRoutes.route("/")
    // Запрос на получение страницы по добавлению курсов:
    .get((req, res) => {
        // Ответом является страница с добавлением курса
        res.status(200).render("pages/add.pug", {
            title: "Добавить курс"
        });
    })
    // Запрос на добавление нового курса:
    .post((req, res) => {
        const course = new Course(req.body.courseName, req.body.coursePrice, req.body.courseImg);
        course.saveCourse();
        res.redirect("/courses");
    });
export default addRoutes;